metalnow/SpectrumAnalyzer/diyspy_ez430/cc2500_regs_.h
#define CC2500_FSCTRL1    0x0B;
#define CC2500_FSCTRL0    0x0C;
#define CC2500_FREQ2      0x0D;
#define CC2500_FREQ1      0x0E;
#define CC2500_FREQ0      0x0F;
#define CC2500_MDMCFG4    0x10;
#define CC2500_MDMCFG3    0x11;
#define CC2500_MDMCFG2    0x12;
#define CC2500_MDMCFG1    0x13;
#define CC2500_MDMCFG0    0x14;
#define CC2500_CHANNR     0x0A;
#define CC2500_DEVIATN    0x15;
#define CC2500_FREND1     0x21;
#define CC2500_FREND0     0x22;
#define CC2500_MCSM0      0x18;
#define CC2500_FOCCFG     0x19;
#define CC2500_BSCFG      0x1A;
#define CC2500_AGCCTRL2   0x1B;
#define CC2500_AGCCTRL1   0x1C;
#define CC2500_AGCCTRL0   0x1D;
#define CC2500_FSCAL3     0x23;
#define CC2500_FSCAL2     0x24;
#define CC2500_FSCAL1     0x25;
#define CC2500_FSCAL0     0x26;
#define CC2500_FSTEST     0x29;
#define CC2500_TEST2      0x2C;
#define CC2500_TEST1      0x2D;
#define CC2500_TEST0      0x2E;
#define CC2500_FIFOTHR    0x03;
#define CC2500_IOCFG2     0x00;
#define CC2500_IOCFG0D    0x02;
#define CC2500_PKTCTRL1   0x07;
#define CC2500_PKTCTRL0   0x08;
#define CC2500_ADDR       0x09;
#define CC2500_PKTLEN     0x06;
